2019/spring-boot-autoconfig-principle.org
#+TITLE:      Spring Boot 自动配置原理
#+AUTHOR:     rgb-24bit
#+EMAIL:      rgb-24bit@foxmail.com
#+DATE:       <2019-06-01 周六>

* 目录                                                    :TOC_4_gh:noexport:
- [[#前言][前言]]
- [[#springapplication][SpringApplication]]
- [[#spring-boot-autoconfigure][Spring Boot AutoConfigure]]
- [[#条件注解][条件注解]]
- [[#webapplicationtype][WebApplicationType]]
- [[#springbootapplication][@SpringBootApplication]]
- [[#简单总结][简单总结]]
- [[#结语][结语]]
- [[#footnotes][Footnotes]]

* 前言
  在学习了 Spring Framework 一段时间后我便开始了 Spring Boot 的学习，在写下一段简单的代码后，我的程序成功的运行了起来。

  但随之而来的不是其简便带来的喜悦，而是是对其原理的困惑与慌张，此时，Spring Boot 在手里就像是一个脱离了自己控制的工具，它存在了一部分在你控制之外的行为，
  而且你还不知道这样的行为是如何发生的。

  我不喜欢这样的感觉，于是我便去查询了相关的资料，解答了自己的疑问。这样一来，脱离了自己控制的那一部分，仿佛又回到了自己的控制之中。

