2019/spring-boot-autoconfig-principle.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-06-01 周六 16:53 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Spring Boot 自动配置原理</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Spring Boot 自动配置原理</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge752321">1. 前言</a></li>
<li><a href="#org6f29305">2. SpringApplication</a></li>
<li><a href="#org904ff12">3. Spring Boot AutoConfigure</a></li>
<li><a href="#org9359491">4. 条件注解</a></li>
<li><a href="#org06506a1">5. WebApplicationType</a></li>
<li><a href="#org4aef677">6. @SpringBootApplication</a></li>
<li><a href="#org575343e">7. 简单总结</a></li>
<li><a href="#org72f997e">8. 结语</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge752321" class="outline-2">
<h2 id="orge752321"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
在学习了 Spring Framework 一段时间后我便开始了 Spring Boot 的学习，在写下一段简单的代码后，我的程序成功的运行了起来。
</p>

<p>
但随之而来的不是其简便带来的喜悦，而是是对其原理的困惑与慌张，此时，Spring Boot 在手里就像是一个脱离了自己控制的工具，它存在了一部分在你控制之外的行为，
而且你还不知道这样的行为是如何发生的。
</p>

<p>
我不喜欢这样的感觉，于是我便去查询了相关的资料，解答了自己的疑问。这样一来，脱离了自己控制的那一部分，仿佛又回到了自己的控制之中。
</p>
</div>
</div>
