2019/spring-boot-autoconfig-principle.org
* SpringApplication
  通常情况下，我们的应用程序可以通过 ~SpringApplication.run(Application.class)~ 启动，所以，我们可以来看一下这个方法到底干了什么：
  #+BEGIN_SRC java
    public class SpringApplication {
      // -----------------------------------------------------------------------------------------------
      // SpringApplication.run(...)
      // -----------------------------------------------------------------------------------------------
      public static ConfigurableApplicationContext run(Class<?> primarySource, String... args) {
        return run(new Class<?>[] { primarySource }, args);
      }

      public static ConfigurableApplicationContext run(Class<?>[] primarySources, String[] args) {
        return new SpringApplication(primarySources).run(args);
      }


      // -----------------------------------------------------------------------------------------------
      // SpringApplication(...)
      // -----------------------------------------------------------------------------------------------
      public SpringApplication(Class<?>... primarySources) {
        this(null, primarySources);
      }

      public SpringApplication(ResourceLoader resourceLoader, Class<?>... primarySources) {
        this.resourceLoader = resourceLoader;
        Assert.notNull(primarySources, "PrimarySources must not be null");
        this.primarySources = new LinkedHashSet<>(Arrays.asList(primarySources));
        this.webApplicationType = WebApplicationType.deduceFromClasspath();
        setInitializers((Collection) getSpringFactoriesInstances(
            ApplicationContextInitializer.class));
        setListeners((Collection) getSpringFactoriesInstances(ApplicationListener.class));
        this.mainApplicationClass = deduceMainApplicationClass();
      }

      // -----------------------------------------------------------------------------------------------
      // SpringApplication.getSpringFactoriesInstances(...)
      // -----------------------------------------------------------------------------------------------
      private <T> Collection<T> getSpringFactoriesInstances(Class<T> type) {
        return getSpringFactoriesInstances(type, new Class<?>[] {});
      }

      private <T> Collection<T> getSpringFactoriesInstances(Class<T> type,
                                                            Class<?>[] parameterTypes, Object... args) {
        ClassLoader classLoader = getClassLoader();
        // Use names and ensure unique to protect against duplicates
        Set<String> names = new LinkedHashSet<>(
            SpringFactoriesLoader.loadFactoryNames(type, classLoader));
        List<T> instances = createSpringFactoriesInstances(type, parameterTypes,
                                                           classLoader, args, names);
        AnnotationAwareOrderComparator.sort(instances);
        return instances;
      }
    }
  #+END_SRC

  上面的代码是和 Spring Boot 自动配置密切相关的部分代码，我们可以看到，当我们调用 ~SpringApplication.run(...)~ 方法后会构造一个 ~SpringApplication~ 实例，而在构造这个实例的过程中，
  我们会调用 ~getSpringFactoriesInstances~ 方法。

  这个方法是实现自动配置过程中非常重要的一个方法，这个方法内部调用了 ~SpringFactoriesLoader.loadFactoryNames~ 方法，我们可以看一下 ~SpringFactoriesLoader~ 做了什么：
  #+BEGIN_SRC java
    public final class SpringFactoriesLoader {
      public static final String FACTORIES_RESOURCE_LOCATION = "META-INF/spring.factories";

      public static List<String> loadFactoryNames(Class<?> factoryType, @Nullable ClassLoader classLoader) {
        String factoryTypeName = factoryType.getName();
        return loadSpringFactories(classLoader).getOrDefault(factoryTypeName, Collections.emptyList());
      }

      private static Map<String, List<String>> loadSpringFactories(@Nullable ClassLoader classLoader) {
        try {
          Enumeration<URL> urls = (classLoader != null ?
                                   classLoader.getResources(FACTORIES_RESOURCE_LOCATION) :
                                   ClassLoader.getSystemResources(FACTORIES_RESOURCE_LOCATION));
          result = new LinkedMultiValueMap<>();
          while (urls.hasMoreElements()) {
            URL url = urls.nextElement();
            UrlResource resource = new UrlResource(url);
            Properties properties = PropertiesLoaderUtils.loadProperties(resource);
            for (Map.Entry<?, ?> entry : properties.entrySet()) {
              String factoryTypeName = ((String) entry.getKey()).trim();
              for (String factoryImplementationName : StringUtils.commaDelimitedListToStringArray((String) entry.getValue())) {
                result.add(factoryTypeName, factoryImplementationName.trim());
              }
            }
          }
          cache.put(classLoader, result);
          return result;
        }
        catch (IOException ex) {
          throw new IllegalArgumentException("Unable to load factories from location [" +
                                             FACTORIES_RESOURCE_LOCATION + "]", ex);
        }
      }
    }
  #+END_SRC

  ~SpringFactoriesLoader~ 是 Spring Framework 提供的一个工具类，调用这个类的 ~loadFactoryNames~ 方法后，会调用 ~loadSpringFactories~ 方法，
  这个方法内部会通过 ~ClassLoader.getResources~ 方法获取所有的 ~META-INF/spring.factories~ 文件中的内容[fn:1]。

  这是非常关键的一点，自动配置便从这里开始了。

