2019/spring-boot-autoconfig-principle.html

<div id="outline-container-org6f29305" class="outline-2">
<h2 id="org6f29305"><span class="section-number-2">2</span> SpringApplication</h2>
<div class="outline-text-2" id="text-2">
<p>
通常情况下，我们的应用程序可以通过 <code>SpringApplication.run(Application.class)</code> 启动，所以，我们可以来看一下这个方法到底干了什么：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">SpringApplication</span> {
  <span class="org-comment-delimiter">// </span><span class="org-comment">-----------------------------------------------------------------------------------------------</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">SpringApplication.run(...)</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">-----------------------------------------------------------------------------------------------</span>
  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">ConfigurableApplicationContext</span> <span class="org-function-name">run</span>(<span class="org-type">Class</span>&lt;?&gt; <span class="org-variable-name">primarySource</span>, <span class="org-type">String</span>... <span class="org-variable-name">args</span>) {
    <span class="org-keyword">return</span> run(<span class="org-keyword">new</span> <span class="org-type">Class</span>&lt;?&gt;[] { primarySource }, args);
  }

  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">ConfigurableApplicationContext</span> <span class="org-function-name">run</span>(<span class="org-type">Class</span>&lt;?&gt;[] <span class="org-variable-name">primarySources</span>, <span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
    <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">SpringApplication</span>(primarySources).run(args);
  }


  <span class="org-comment-delimiter">// </span><span class="org-comment">-----------------------------------------------------------------------------------------------</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">SpringApplication(...)</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">-----------------------------------------------------------------------------------------------</span>
  <span class="org-keyword">public</span> <span class="org-function-name">SpringApplication</span>(<span class="org-constant">Class</span>&lt;?&gt;... <span class="org-variable-name">primarySources</span>) {
    <span class="org-keyword">this</span>(<span class="org-constant">null</span>, primarySources);
  }

  <span class="org-keyword">public</span> <span class="org-function-name">SpringApplication</span>(<span class="org-type">ResourceLoader</span> <span class="org-variable-name">resourceLoader</span>, <span class="org-constant">Class</span>&lt;?&gt;... <span class="org-variable-name">primarySources</span>) {
    <span class="org-keyword">this</span>.resourceLoader = resourceLoader;
    Assert.notNull(primarySources, <span class="org-string">"PrimarySources must not be null"</span>);
    <span class="org-keyword">this</span>.primarySources = <span class="org-keyword">new</span> <span class="org-type">LinkedHashSet</span>&lt;&gt;(Arrays.asList(primarySources));
    <span class="org-keyword">this</span>.webApplicationType = WebApplicationType.deduceFromClasspath();
    setInitializers((<span class="org-type">Collection</span>) getSpringFactoriesInstances(
        ApplicationContextInitializer.<span class="org-keyword">class</span>));
    setListeners((<span class="org-type">Collection</span>) getSpringFactoriesInstances(ApplicationListener.<span class="org-keyword">class</span>));
    <span class="org-keyword">this</span>.mainApplicationClass = deduceMainApplicationClass();
  }

  <span class="org-comment-delimiter">// </span><span class="org-comment">-----------------------------------------------------------------------------------------------</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">SpringApplication.getSpringFactoriesInstances(...)</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">-----------------------------------------------------------------------------------------------</span>
  <span class="org-keyword">private</span> &lt;<span class="org-type">T</span>&gt; <span class="org-type">Collection</span>&lt;<span class="org-type">T</span>&gt; <span class="org-function-name">getSpringFactoriesInstances</span>(<span class="org-type">Class</span>&lt;<span class="org-type">T</span>&gt; <span class="org-variable-name">type</span>) {
    <span class="org-keyword">return</span> getSpringFactoriesInstances(type, <span class="org-keyword">new</span> <span class="org-type">Class</span>&lt;?&gt;[] {});
  }

  <span class="org-keyword">private</span> &lt;<span class="org-type">T</span>&gt; <span class="org-type">Collection</span>&lt;<span class="org-type">T</span>&gt; <span class="org-function-name">getSpringFactoriesInstances</span>(<span class="org-type">Class</span>&lt;<span class="org-type">T</span>&gt; <span class="org-variable-name">type</span>,
                                                        <span class="org-type">Class</span>&lt;?&gt;[] <span class="org-variable-name">parameterTypes</span>, <span class="org-type">Object</span>... <span class="org-variable-name">args</span>) {
    <span class="org-type">ClassLoader</span> <span class="org-variable-name">classLoader</span> = getClassLoader();
    <span class="org-comment-delimiter">// </span><span class="org-comment">Use names and ensure unique to protect against duplicates</span>
    <span class="org-type">Set</span>&lt;<span class="org-type">String</span>&gt; <span class="org-variable-name">names</span> = <span class="org-keyword">new</span> <span class="org-type">LinkedHashSet</span>&lt;&gt;(
        SpringFactoriesLoader.loadFactoryNames(type, classLoader));
    <span class="org-type">List</span>&lt;<span class="org-type">T</span>&gt; <span class="org-variable-name">instances</span> = createSpringFactoriesInstances(type, parameterTypes,
                                                       classLoader, args, names);
    AnnotationAwareOrderComparator.sort(instances);
    <span class="org-keyword">return</span> instances;
  }
}
</pre>
</div>

<p>
上面的代码是和 Spring Boot 自动配置密切相关的部分代码，我们可以看到，当我们调用 <code>SpringApplication.run(...)</code> 方法后会构造一个 <code>SpringApplication</code> 实例，而在构造这个实例的过程中，
我们会调用 <code>getSpringFactoriesInstances</code> 方法。
</p>

<p>
这个方法是实现自动配置过程中非常重要的一个方法，这个方法内部调用了 <code>SpringFactoriesLoader.loadFactoryNames</code> 方法，我们可以看一下 <code>SpringFactoriesLoader</code> 做了什么：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">final</span> <span class="org-keyword">class</span> <span class="org-type">SpringFactoriesLoader</span> {
  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">final</span> <span class="org-type">String</span> <span class="org-variable-name">FACTORIES_RESOURCE_LOCATION</span> = <span class="org-string">"META-INF/spring.factories"</span>;

  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">List</span>&lt;<span class="org-type">String</span>&gt; <span class="org-function-name">loadFactoryNames</span>(<span class="org-type">Class</span>&lt;?&gt; <span class="org-variable-name">factoryType</span>, <span class="org-c-annotation">@Nullable</span> <span class="org-type">ClassLoader</span> <span class="org-variable-name">classLoader</span>) {
    <span class="org-type">String</span> <span class="org-variable-name">factoryTypeName</span> = factoryType.getName();
    <span class="org-keyword">return</span> loadSpringFactories(classLoader).getOrDefault(factoryTypeName, Collections.emptyList());
  }

  <span class="org-keyword">private</span> <span class="org-keyword">static</span> <span class="org-type">Map</span>&lt;<span class="org-type">String</span>, <span class="org-type">List</span>&lt;<span class="org-type">String</span>&gt;&gt; <span class="org-function-name">loadSpringFactories</span>(<span class="org-c-annotation">@Nullable</span> <span class="org-type">ClassLoader</span> <span class="org-variable-name">classLoader</span>) {
    <span class="org-keyword">try</span> {
      <span class="org-type">Enumeration</span>&lt;<span class="org-type">URL</span>&gt; <span class="org-variable-name">urls</span> = (classLoader != <span class="org-constant">null</span> ?
                               classLoader.getResources(FACTORIES_RESOURCE_LOCATION) :
                               ClassLoader.getSystemResources(FACTORIES_RESOURCE_LOCATION));
      result = <span class="org-keyword">new</span> <span class="org-type">LinkedMultiValueMap</span>&lt;&gt;();
      <span class="org-keyword">while</span> (urls.hasMoreElements()) {
        <span class="org-type">URL</span> <span class="org-variable-name">url</span> = urls.nextElement();
        <span class="org-type">UrlResource</span> <span class="org-variable-name">resource</span> = <span class="org-keyword">new</span> <span class="org-type">UrlResource</span>(url);
        <span class="org-type">Properties</span> <span class="org-variable-name">properties</span> = PropertiesLoaderUtils.loadProperties(resource);
        <span class="org-keyword">for</span> (<span class="org-constant">Map</span>.<span class="org-type">Entry</span>&lt;?, ?&gt; <span class="org-function-name">entry</span> : properties.entrySet()) {
          <span class="org-type">String</span> <span class="org-variable-name">factoryTypeName</span> = ((<span class="org-type">String</span>) entry.getKey()).trim();
          <span class="org-keyword">for</span> (<span class="org-type">String</span> <span class="org-function-name">factoryImplementationName</span> : StringUtils.commaDelimitedListToStringArray((<span class="org-type">String</span>) entry.getValue())) {
            result.add(factoryTypeName, factoryImplementationName.trim());
          }
        }
      }
      cache.put(classLoader, result);
      <span class="org-keyword">return</span> result;
    }
    <span class="org-keyword">catch</span> (<span class="org-type">IOException</span> <span class="org-variable-name">ex</span>) {
      <span class="org-keyword">throw</span> <span class="org-keyword">new</span> <span class="org-type">IllegalArgumentException</span>(<span class="org-string">"Unable to load factories from location ["</span> +
                                         FACTORIES_RESOURCE_LOCATION + <span class="org-string">"]"</span>, ex);
    }
  }
}
</pre>
</div>

<p>
<code>SpringFactoriesLoader</code> 是 Spring Framework 提供的一个工具类，调用这个类的 <code>loadFactoryNames</code> 方法后，会调用 <code>loadSpringFactories</code> 方法，
这个方法内部会通过 <code>ClassLoader.getResources</code> 方法获取所有的 <code>META-INF/spring.factories</code> 文件中的内容<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。
</p>

<p>
这是非常关键的一点，自动配置便从这里开始了。
</p>
</div>
</div>
