2019/spring-boot-autoconfig-principle.org
* Spring Boot AutoConfigure
  Spring Boot 中的自动配置很大一部分是通过 ~spring-boot-autoconfigure~ 完成的，SpringApplication 启动时会解析它的 ~META-INF/spring.factories~ 文件：
  #+BEGIN_EXAMPLE
    # Initializers
    org.springframework.context.ApplicationContextInitializer=\
    org.springframework.boot.autoconfigure.SharedMetadataReaderFactoryContextInitializer,\
    org.springframework.boot.autoconfigure.logging.ConditionEvaluationReportLoggingListener

    # Application Listeners
    org.springframework.context.ApplicationListener=\
    org.springframework.boot.autoconfigure.BackgroundPreinitializer

    # Auto Configuration Import Listeners
    org.springframework.boot.autoconfigure.AutoConfigurationImportListener=\
    org.springframework.boot.autoconfigure.condition.ConditionEvaluationReportAutoConfigurationImportListener

    # Auto Configuration Import Filters
    org.springframework.boot.autoconfigure.AutoConfigurationImportFilter=\
    org.springframework.boot.autoconfigure.condition.OnBeanCondition,\
    org.springframework.boot.autoconfigure.condition.OnClassCondition,\
    org.springframework.boot.autoconfigure.condition.OnWebApplicationCondition

    # Auto Configure
    org.springframework.boot.autoconfigure.EnableAutoConfiguration=\
    org.springframework.boot.autoconfigure.admin.SpringApplicationAdminJmxAutoConfiguration,\
    org.springframework.boot.autoconfigure.aop.AopAutoConfiguration,\

    ......
  #+END_EXAMPLE

  可以看到，这个文件中声明了很多的类，也就是说，自动配置就是通过这些类来完成的。我们可以来看一下这些类做了什么：
  #+BEGIN_SRC java
    @AutoConfigureOrder(Ordered.HIGHEST_PRECEDENCE)
    @Configuration
    @ConditionalOnWebApplication(type = Type.SERVLET)
    @ConditionalOnClass(DispatcherServlet.class)
    @AutoConfigureAfter(ServletWebServerFactoryAutoConfiguration.class)
    public class DispatcherServletAutoConfiguration {
      public static final String DEFAULT_DISPATCHER_SERVLET_BEAN_NAME = "dispatcherServlet";

      public static final String DEFAULT_DISPATCHER_SERVLET_REGISTRATION_BEAN_NAME = "dispatcherServletRegistration";

      @Configuration
      @Conditional(DefaultDispatcherServletCondition.class)
      @ConditionalOnClass(ServletRegistration.class)
      @EnableConfigurationProperties({ HttpProperties.class, WebMvcProperties.class })
      protected static class DispatcherServletConfiguration {
        @Bean(name = DEFAULT_DISPATCHER_SERVLET_BEAN_NAME)
        public DispatcherServlet dispatcherServlet() {
          DispatcherServlet dispatcherServlet = new DispatcherServlet();
          return dispatcherServlet;
        }
      }
    }
  #+END_SRC

  上面这个类是经过极大简化的 ~DispatcherServletAutoConfiguration~ 类，可以看到，这个类内部声明配置了 ~DispatcherServlet~, 通常情况下，在使用 Spring MVC 的过程中，
  这是由我们自己完成的，但是在这里，自动配置帮助我们完成了这一步骤。

  除了 DispatcherServletAutoConfiguration 以外，还有很多类似的配置类，这些类利用了一些很有用的 Spring 特性来完成整个配置过程。
 
* 条件注解
  Spring Boot 的自动配置类使用了大量的条件注解，通过这些条件注解，Spring Boot 很好的完成了配置工作，同时，因为存在条件注解的原因，我们可以覆盖 Spring Boot 的默认配置。

  条件注解有很多，这篇博客也不是专门介绍这方面的博客，因此这里简单列举三个在自动配置中大量使用的注解：
  |---------------------------+----------------------------------|
  | 条件注解                  | 作用                             |
  |---------------------------+----------------------------------|
  | @ConditionalOnClass       | 仅在存在某个 Class 的情况下生效  |
  | @ConditionalOnBean        | 仅在存在某个 Bean 的情况下生效   |
  | @ConditionalOnMissingBean | 仅在不存在每个 Bean 的情况下生效 |
  |---------------------------+----------------------------------|

  其中，通过 @ConditionalOnClass 注解，我们便可以通过引入 *不同依赖* 的方式应用不同的配置，比如，当类路径下存在 ~jackson~ 的情况下，Spring 可以自动完成 ~jackson~ 的相关配置。

  同时，通过 @ConditionalOnBean 可以保证配置依赖的 Bean 存在时才进行下一步的配置，而 ~@ConditionalOnMissingBean~ 正好与之相反，它要求相应的 Bean 不存在才执行下一步的配置。

  这意味着，我们可以自己配置某种 Bean，由于 Spring Boot 会先执行我们的配置，因此，当我们配置的 Bean 存在后，相应的默认配置就不会再执行。而且，还不会影响后序的配置过程。

  于是，我们便可以通过定义自己的 Bean 的方式覆盖默认的配置。

