2019/spring-boot-autoconfig-principle.html

<div id="outline-container-org904ff12" class="outline-2">
<h2 id="org904ff12"><span class="section-number-2">3</span> Spring Boot AutoConfigure</h2>
<div class="outline-text-2" id="text-3">
<p>
Spring Boot 中的自动配置很大一部分是通过 <code>spring-boot-autoconfigure</code> 完成的，SpringApplication 启动时会解析它的 <code>META-INF/spring.factories</code> 文件：
</p>
<pre class="example">
# Initializers
org.springframework.context.ApplicationContextInitializer=\
org.springframework.boot.autoconfigure.SharedMetadataReaderFactoryContextInitializer,\
org.springframework.boot.autoconfigure.logging.ConditionEvaluationReportLoggingListener

# Application Listeners
org.springframework.context.ApplicationListener=\
org.springframework.boot.autoconfigure.BackgroundPreinitializer

# Auto Configuration Import Listeners
org.springframework.boot.autoconfigure.AutoConfigurationImportListener=\
org.springframework.boot.autoconfigure.condition.ConditionEvaluationReportAutoConfigurationImportListener

# Auto Configuration Import Filters
org.springframework.boot.autoconfigure.AutoConfigurationImportFilter=\
org.springframework.boot.autoconfigure.condition.OnBeanCondition,\
org.springframework.boot.autoconfigure.condition.OnClassCondition,\
org.springframework.boot.autoconfigure.condition.OnWebApplicationCondition

# Auto Configure
org.springframework.boot.autoconfigure.EnableAutoConfiguration=\
org.springframework.boot.autoconfigure.admin.SpringApplicationAdminJmxAutoConfiguration,\
org.springframework.boot.autoconfigure.aop.AopAutoConfiguration,\

......
</pre>

<p>
可以看到，这个文件中声明了很多的类，也就是说，自动配置就是通过这些类来完成的。我们可以来看一下这些类做了什么：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-c-annotation">@AutoConfigureOrder</span>(<span class="org-constant">Ordered</span>.<span class="org-type">HIGHEST_PRECEDENCE</span>)
<span class="org-c-annotation">@Configuration</span>
<span class="org-c-annotation">@ConditionalOnWebApplication</span>(type = <span class="org-constant">Type</span>.SERVLET)
<span class="org-c-annotation">@ConditionalOnClass</span>(DispatcherServlet.<span class="org-keyword">class</span>)
<span class="org-c-annotation">@AutoConfigureAfter</span>(ServletWebServerFactoryAutoConfiguration.<span class="org-keyword">class</span>)
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">DispatcherServletAutoConfiguration</span> {
  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">final</span> <span class="org-type">String</span> <span class="org-variable-name">DEFAULT_DISPATCHER_SERVLET_BEAN_NAME</span> = <span class="org-string">"dispatcherServlet"</span>;

  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">final</span> <span class="org-type">String</span> <span class="org-variable-name">DEFAULT_DISPATCHER_SERVLET_REGISTRATION_BEAN_NAME</span> = <span class="org-string">"dispatcherServletRegistration"</span>;

  <span class="org-c-annotation">@Configuration</span>
  <span class="org-c-annotation">@Conditional</span>(DefaultDispatcherServletCondition.<span class="org-keyword">class</span>)
  <span class="org-c-annotation">@ConditionalOnClass</span>(ServletRegistration.<span class="org-keyword">class</span>)
  <span class="org-c-annotation">@EnableConfigurationProperties</span>({ HttpProperties.<span class="org-keyword">class</span>, WebMvcProperties.<span class="org-keyword">class</span> })
  <span class="org-keyword">protected</span> <span class="org-keyword">static</span> <span class="org-keyword">class</span> <span class="org-type">DispatcherServletConfiguration</span> {
    <span class="org-c-annotation">@Bean</span>(name = DEFAULT_DISPATCHER_SERVLET_BEAN_NAME)
    <span class="org-keyword">public</span> <span class="org-type">DispatcherServlet</span> <span class="org-function-name">dispatcherServlet</span>() {
      <span class="org-type">DispatcherServlet</span> <span class="org-variable-name">dispatcherServlet</span> = <span class="org-keyword">new</span> <span class="org-type">DispatcherServlet</span>();
      <span class="org-keyword">return</span> dispatcherServlet;
    }
  }
}
</pre>
</div>

<p>
上面这个类是经过极大简化的 <code>DispatcherServletAutoConfiguration</code> 类，可以看到，这个类内部声明配置了 <code>DispatcherServlet</code>, 通常情况下，在使用 Spring MVC 的过程中，
这是由我们自己完成的，但是在这里，自动配置帮助我们完成了这一步骤。
</p>

<p>
除了 DispatcherServletAutoConfiguration 以外，还有很多类似的配置类，这些类利用了一些很有用的 Spring 特性来完成整个配置过程。
</p>
</div>
</div>

<div id="outline-container-org9359491" class="outline-2">
<h2 id="org9359491"><span class="section-number-2">4</span> 条件注解</h2>
<div class="outline-text-2" id="text-4">
<p>
Spring Boot 的自动配置类使用了大量的条件注解，通过这些条件注解，Spring Boot 很好的完成了配置工作，同时，因为存在条件注解的原因，我们可以覆盖 Spring Boot 的默认配置。
</p>

<p>
条件注解有很多，这篇博客也不是专门介绍这方面的博客，因此这里简单列举三个在自动配置中大量使用的注解：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">条件注解</th>
<th scope="col" class="org-left">作用</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">@ConditionalOnClass</td>
<td class="org-left">仅在存在某个 Class 的情况下生效</td>
</tr>

<tr>
<td class="org-left">@ConditionalOnBean</td>
<td class="org-left">仅在存在某个 Bean 的情况下生效</td>
</tr>

<tr>
<td class="org-left">@ConditionalOnMissingBean</td>
<td class="org-left">仅在不存在每个 Bean 的情况下生效</td>
</tr>
</tbody>
</table>

<p>
其中，通过 @ConditionalOnClass 注解，我们便可以通过引入 <b>不同依赖</b> 的方式应用不同的配置，比如，当类路径下存在 <code>jackson</code> 的情况下，Spring 可以自动完成 <code>jackson</code> 的相关配置。
</p>

<p>
同时，通过 @ConditionalOnBean 可以保证配置依赖的 Bean 存在时才进行下一步的配置，而 <code>@ConditionalOnMissingBean</code> 正好与之相反，它要求相应的 Bean 不存在才执行下一步的配置。
</p>

<p>
这意味着，我们可以自己配置某种 Bean，由于 Spring Boot 会先执行我们的配置，因此，当我们配置的 Bean 存在后，相应的默认配置就不会再执行。而且，还不会影响后序的配置过程。
</p>

<p>
于是，我们便可以通过定义自己的 Bean 的方式覆盖默认的配置。
</p>
</div>
</div>
